lerouxb/arduino-config-parser/output/DxCore/boards.txt
# Enable SerialEvent, even though it's bad
avrdb.menu.serialevent.no=No
avrdb.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
avrdb.menu.serialevent.yes=Yes

# BrownOut Detect Options
avrdb.menu.bodvoltage.1v9=1.9V
avrdb.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdb.menu.bodvoltage.2v45=2.45V
avrdb.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdb.menu.bodvoltage.2v70=2.70V
avrdb.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdb.menu.bodvoltage.2v85=2.85V
avrdb.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdb.menu.bodmode.disabled=Disabled/Disabled
avrdb.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdb.menu.bodmode.enabled=Enabled/Enabled
avrdb.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdb.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
avrdb.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdb.menu.bodmode.ensampslo=Enabled/Sampled (125Hz)
avrdb.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
avrdb.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
avrdb.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
avrdb.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdb.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
avrdb.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdb.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdb.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100
avrdb.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdb.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdb.menu.bodmode.sampleslow.bootloader.bodmodebits=11010

# EESAVE option
avrdb.menu.eesave.enable=EEPROM retained
avrdb.menu.eesave.enable.bootloader.eesavebit=1
avrdb.menu.eesave.disable=EEPROM not retained
avrdb.menu.eesave.disable.bootloader.eesavebit=0

# Reset pin as GPIO option
avrdb.menu.resetpin.reset=Hardware Reset (recommended)
avrdb.menu.resetpin.reset.bootloader.resetpinbits=10
avrdb.menu.resetpin.input=Input (no output, ever)
avrdb.menu.resetpin.input.bootloader.resetpinbits=00

# millis/micros timing source
# TCD0 and RTC not yet supported
avrdb.menu.millis.tcb2=TCB2
avrdb.menu.millis.tcb2.build.millistimer=B2
avrdb.menu.millis.tcb0=TCB0
avrdb.menu.millis.tcb0.build.millistimer=B0
avrdb.menu.millis.tcb1=TCB1
avrdb.menu.millis.tcb1.build.millistimer=B1
avrdb.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdb.menu.millis.tcb3.build.millistimer=B3
avrdb.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdb.menu.millis.tcb4.build.millistimer=B4
avrdb.menu.millis.tca0=TCA0
avrdb.menu.millis.tca0.build.millistimer=A0
avrdb.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdb.menu.millis.tca1.build.millistimer=A1
#avrdb.menu.millis.tcd0=TCD0
#avrdb.menu.millis.rtc=RTC (no micros)
#avrdb.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal no micros
#avrdb.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrdb.menu.millis.disabled=Disabled
#avrdb.menu.millis.tcd0.build.millistimer=D0
#avrdb.menu.millis.rtc.build.millistimer=RTC
#avrdb.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrdb.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrdb.menu.millis.disabled.build.millistimer=NONE

#avrdb.menu.mvio.enabled=Enabled
#avrdb.menu.mvio.enabled.bootloader.mviobits=01
#avrdb.menu.mvio.disabled=Disabled
#avrdb.menu.mvio.disabled.bootloader.mviobits=10

# Startup Time
avrdb.menu.startuptime.8= 8ms
avrdb.menu.startuptime.8.bootloader.sutbits=100
avrdb.menu.startuptime.1= 1ms
avrdb.menu.startuptime.1.bootloader.sutbits=001
avrdb.menu.startuptime.2= 2ms
avrdb.menu.startuptime.2.bootloader.sutbits=010
avrdb.menu.startuptime.4= 4ms
avrdb.menu.startuptime.4.bootloader.sutbits=011
avrdb.menu.startuptime.16= 16ms
avrdb.menu.startuptime.16.bootloader.sutbits=101
avrdb.menu.startuptime.32= 32ms
avrdb.menu.startuptime.32.bootloader.sutbits=110
avrdb.menu.startuptime.64= 64ms
avrdb.menu.startuptime.64.bootloader.sutbits=111
avrdb.menu.startuptime.0.bootloader.sutbits=000
#avrdd.name=AVR DD-series (no bootloader)
avrdaopti.name=AVR DA-series (Optiboot)




#########################################
#
#    AVR DA-series (Optiboot)
#
#########################################

################################
# Constant across all settings #
################################

avrdaopti.upload.tool=avrdude

# Upload settings
avrdaopti.upload.protocol=arduino
avrdaopti.upload.extra_params=-D
avrdaopti.upload.speed=115200

# Build settings
avrdaopti.build.board=avrda
avrdaopti.build.core=dxcore
avrdaopti.build.text_section_start=.text=0x200
avrdaopti.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource} -DUSING_OPTIBOOT
avrdaopti.build.export_merged_output=false
avrdaopti.build.mcupostfix=opti
avrdaopti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}

# Bootloading settings
avrdaopti.bootloader.tool=avrdude
avrdaopti.bootloader.WDTCFG=0x00
avrdaopti.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
avrdaopti.bootloader.CODESIZE=0x00
avrdaopti.bootloader.BOOTSIZE=0x01
avrdaopti.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrdaopti.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex -a write

################################
# Tools Submenu Options        #
################################

# Chip (pins and memory size)
avrdaopti.menu.chip.128DA28=AVR128DA28
avrdaopti.menu.chip.128DA28.build.mcu=avr128da28
avrdaopti.menu.chip.128DA28.build.variant=28pin-standard
avrdaopti.menu.chip.128DA28.upload.maximum_size=130560
avrdaopti.menu.chip.128DA28.upload.maximum_data_size=16384
avrdaopti.menu.chip.128DA28.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.128DA32=AVR128DA32
avrdaopti.menu.chip.128DA32.build.mcu=avr128da32
avrdaopti.menu.chip.128DA32.build.variant=32pin-standard
avrdaopti.menu.chip.128DA32.upload.maximum_size=130560
avrdaopti.menu.chip.128DA32.upload.maximum_data_size=16384
avrdaopti.menu.chip.128DA32.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.128DA48=AVR128DA48
avrdaopti.menu.chip.128DA48.build.mcu=avr128da48
avrdaopti.menu.chip.128DA48.build.variant=48pin-standard
avrdaopti.menu.chip.128DA48.upload.maximum_size=130560
avrdaopti.menu.chip.128DA48.upload.maximum_data_size=16384
avrdaopti.menu.chip.128DA48.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.128DA64=AVR128DA64
avrdaopti.menu.chip.128DA64.build.mcu=avr128da64
avrdaopti.menu.chip.128DA64.build.variant=64pin-standard
avrdaopti.menu.chip.128DA64.upload.maximum_size=130560
avrdaopti.menu.chip.128DA64.upload.maximum_data_size=16384
avrdaopti.menu.chip.128DA64.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.64DA28=AVR64DA28
avrdaopti.menu.chip.64DA28.build.mcu=avr64da28
avrdaopti.menu.chip.64DA28.build.variant=28pin-standard
avrdaopti.menu.chip.64DA28.upload.maximum_size=65024
avrdaopti.menu.chip.64DA28.upload.maximum_data_size=8192
avrdaopti.menu.chip.64DA28.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.64DA32=AVR64DA32
avrdaopti.menu.chip.64DA32.build.mcu=avr64da32
avrdaopti.menu.chip.64DA32.build.variant=32pin-standard
avrdaopti.menu.chip.64DA32.upload.maximum_size=65024
avrdaopti.menu.chip.64DA32.upload.maximum_data_size=8192
avrdaopti.menu.chip.64DA32.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.64DA48=AVR64DA48
avrdaopti.menu.chip.64DA48.build.mcu=avr64da48
avrdaopti.menu.chip.64DA48.build.variant=48pin-standard
avrdaopti.menu.chip.64DA48.upload.maximum_size=65024
avrdaopti.menu.chip.64DA48.upload.maximum_data_size=8192
avrdaopti.menu.chip.64DA48.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.64DA64=AVR64DA64
avrdaopti.menu.chip.64DA64.build.mcu=avr64da64
avrdaopti.menu.chip.64DA64.build.variant=64pin-standard
avrdaopti.menu.chip.64DA64.upload.maximum_size=65024
avrdaopti.menu.chip.64DA64.upload.maximum_data_size=8192
avrdaopti.menu.chip.64DA64.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.32DA28=AVR32DA28
avrdaopti.menu.chip.32DA28.build.mcu=avr32da28
avrdaopti.menu.chip.32DA28.build.variant=28pin-standard
avrdaopti.menu.chip.32DA28.upload.maximum_size=32256
avrdaopti.menu.chip.32DA28.upload.maximum_data_size=4096
avrdaopti.menu.chip.32DA28.bootloader.file=optiboot_dx32
avrdaopti.menu.chip.32DA32=AVR32DA32
avrdaopti.menu.chip.32DA32.build.mcu=avr32da32
avrdaopti.menu.chip.32DA32.build.variant=32pin-standard
avrdaopti.menu.chip.32DA32.upload.maximum_size=32256
avrdaopti.menu.chip.32DA32.upload.maximum_data_size=4096
avrdaopti.menu.chip.32DA32.bootloader.file=optiboot_dx32
avrdaopti.menu.chip.32DA48=AVR32DA48
avrdaopti.menu.chip.32DA48.build.mcu=avr32da48
avrdaopti.menu.chip.32DA48.build.variant=48pin-standard
avrdaopti.menu.chip.32DA48.upload.maximum_size=32256
avrdaopti.menu.chip.32DA48.upload.maximum_data_size=4096
avrdaopti.menu.chip.32DA48.bootloader.file=optiboot_dx32

# Clock Speed + Source
avrdaopti.menu.clock.24internal=24 MHz internal
avrdaopti.menu.clock.24internal.build.f_cpu=24000000L
avrdaopti.menu.clock.24internal.build.speed=24
avrdaopti.menu.clock.24internal.build.clocksource=0
avrdaopti.menu.clock.20internal=20 MHz internal
avrdaopti.menu.clock.20internal.build.f_cpu=20000000L
avrdaopti.menu.clock.20internal.build.speed=20
avrdaopti.menu.clock.20internal.build.clocksource=0
avrdaopti.menu.clock.16internal=16 MHz internal
avrdaopti.menu.clock.16internal.build.f_cpu=16000000L
avrdaopti.menu.clock.16internal.build.speed=16
avrdaopti.menu.clock.16internal.build.clocksource=0
avrdaopti.menu.clock.12internal=12 MHz internal
avrdaopti.menu.clock.12internal.build.f_cpu=12000000L
avrdaopti.menu.clock.12internal.build.speed=12
avrdaopti.menu.clock.12internal.build.clocksource=0
avrdaopti.menu.clock.10internal=10 MHz internal
avrdaopti.menu.clock.10internal.build.f_cpu=10000000L
avrdaopti.menu.clock.10internal.build.speed=10
avrdaopti.menu.clock.10internal.build.clocksource=0
avrdaopti.menu.clock.8internal=8 MHz internal
avrdaopti.menu.clock.8internal.build.f_cpu=8000000L
avrdaopti.menu.clock.8internal.build.speed=8
avrdaopti.menu.clock.8internal.build.clocksource=0
avrdaopti.menu.clock.4internal=4 MHz internal
avrdaopti.menu.clock.4internal.build.f_cpu=4000000L
avrdaopti.menu.clock.4internal.build.speed=4
avrdaopti.menu.clock.4internal.build.clocksource=0
avrdaopti.menu.clock.1internal=1 MHz internal
avrdaopti.menu.clock.1internal.build.f_cpu=1000000L
avrdaopti.menu.clock.1internal.build.speed=1
avrdaopti.menu.clock.1internal.build.clocksource=0
avrdaopti.menu.clock.24extclock=24 MHz ext. clock
avrdaopti.menu.clock.24extclock.build.f_cpu=24000000L
avrdaopti.menu.clock.24extclock.build.speed=24
avrdaopti.menu.clock.24extclock.build.clocksource=2
avrdaopti.menu.clock.20extclock=20 MHz ext. clock
avrdaopti.menu.clock.20extclock.build.f_cpu=20000000L
avrdaopti.menu.clock.20extclock.build.speed=20
avrdaopti.menu.clock.20extclock.build.clocksource=2
avrdaopti.menu.clock.16extclock=16 MHz ext. clock
avrdaopti.menu.clock.16extclock.build.f_cpu=16000000L
avrdaopti.menu.clock.16extclock.build.speed=16
avrdaopti.menu.clock.16extclock.build.clocksource=2
avrdaopti.menu.clock.12extclock=12 MHz ext. clock
avrdaopti.menu.clock.12extclock.build.f_cpu=12000000L
avrdaopti.menu.clock.12extclock.build.speed=12
avrdaopti.menu.clock.12extclock.build.clocksource=2
avrdaopti.menu.clock.8extclock=8 MHz ext. clock
avrdaopti.menu.clock.8extclock.build.f_cpu=8000000L
avrdaopti.menu.clock.8extclock.build.speed=8
avrdaopti.menu.clock.8extclock.build.clocksource=2
avrdaopti.menu.clock.28internal=28 MHz internal (overclocked)
avrdaopti.menu.clock.28internal.build.f_cpu=28000000L
avrdaopti.menu.clock.28internal.build.speed=28
avrdaopti.menu.clock.28internal.build.clocksource=0
avrdaopti.menu.clock.32internal=32 MHz internal (overclocked)
avrdaopti.menu.clock.32internal.build.f_cpu=32000000L
avrdaopti.menu.clock.32internal.build.speed=32
avrdaopti.menu.clock.32internal.build.clocksource=0
avrdaopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdaopti.menu.clock.28extclock.build.f_cpu=28000000L
avrdaopti.menu.clock.28extclock.build.speed=28
avrdaopti.menu.clock.28extclock.build.clocksource=2
avrdaopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdaopti.menu.clock.32extclock.build.f_cpu=32000000L
avrdaopti.menu.clock.32extclock.build.speed=32
avrdaopti.menu.clock.32extclock.build.clocksource=2
avrdaopti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdaopti.menu.clock.36extclock.build.f_cpu=36000000L
avrdaopti.menu.clock.36extclock.build.speed=36
avrdaopti.menu.clock.36extclock.build.clocksource=2
avrdaopti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdaopti.menu.clock.40extclock.build.f_cpu=40000000L
avrdaopti.menu.clock.40extclock.build.speed=40
avrdaopti.menu.clock.40extclock.build.clocksource=2
avrdaopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdaopti.menu.clock.48extclock.build.f_cpu=48000000L
avrdaopti.menu.clock.48extclock.build.speed=48
avrdaopti.menu.clock.48extclock.build.clocksource=2

