lerouxb/arduino-config-parser/output/DxCore/boards.txt
# Enable SerialEvent, even though it's bad
avrdaopti.menu.serialevent.no=No
avrdaopti.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
avrdaopti.menu.serialevent.yes=Yes

# BrownOut Detect Options
avrdaopti.menu.bodvoltage.1v9=1.9V
avrdaopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdaopti.menu.bodvoltage.2v45=2.45V
avrdaopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdaopti.menu.bodvoltage.2v70=2.70V
avrdaopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdaopti.menu.bodvoltage.2v85=2.85V
avrdaopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdaopti.menu.bodmode.disabled=Disabled/Disabled
avrdaopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdaopti.menu.bodmode.enabled=Enabled/Enabled
avrdaopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdaopti.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
avrdaopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdaopti.menu.bodmode.ensampslo=Enabled/Sampled (125Hz)
avrdaopti.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
avrdaopti.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
avrdaopti.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
avrdaopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdaopti.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
avrdaopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdaopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdaopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100
avrdaopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdaopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdaopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010

# Reset pin as GPIO option
avrdaopti.menu.resetpin.reset=Hardware Reset (recommended)
avrdaopti.menu.resetpin.reset.bootloader.resetpinbits=10
avrdaopti.menu.resetpin.input=Input (no output, ever)
avrdaopti.menu.resetpin.input.bootloader.resetpinbits=00

# millis/micros timing source
# TCD0 and RTC not yet supported
avrdaopti.menu.millis.tcb2=TCB2
avrdaopti.menu.millis.tcb2.build.millistimer=B2
avrdaopti.menu.millis.tcb0=TCB0
avrdaopti.menu.millis.tcb0.build.millistimer=B0
avrdaopti.menu.millis.tcb1=TCB1
avrdaopti.menu.millis.tcb1.build.millistimer=B1
avrdaopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdaopti.menu.millis.tcb3.build.millistimer=B3
avrdaopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdaopti.menu.millis.tcb4.build.millistimer=B4
avrdaopti.menu.millis.tca0=TCA0
avrdaopti.menu.millis.tca0.build.millistimer=A0
avrdaopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdaopti.menu.millis.tca1.build.millistimer=A1
#avrdaopti.menu.millis.tcd0=TCD0
#avrdaopti.menu.millis.rtc=RTC (no micros)
#avrdaopti.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal no micros
#avrdaopti.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrdaopti.menu.millis.disabled=Disabled
#avrdaopti.menu.millis.tcd0.build.millistimer=D0
#avrdaopti.menu.millis.rtc.build.millistimer=RTC
#avrdaopti.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrdaopti.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrdaopti.menu.millis.disabled.build.millistimer=NONE

# Startup Time
avrdaopti.menu.startuptime.8= 8ms
avrdaopti.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrdaopti.menu.startuptime.1= 1ms
avrdaopti.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrdaopti.menu.startuptime.2= 2ms
avrdaopti.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrdaopti.menu.startuptime.4= 4ms
avrdaopti.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrdaopti.menu.startuptime.16= 16ms
avrdaopti.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrdaopti.menu.startuptime.32= 32ms
avrdaopti.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrdaopti.menu.startuptime.64= 64ms
avrdaopti.menu.startuptime.64.bootloader.SYSCFG1=0x07
avrdaopti.menu.startuptime.0.bootloader.SYSCFG1=0x00

# Optiboot Upload Timeout
avrdaopti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdaopti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdaopti.menu.timeout.8sec.bootloader.timeout=_8sec

# Optiboot Serial Port
avrdaopti.menu.bootloaderusart.ser0=USART0: TX PA0, RX PA1
avrdaopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdaopti.menu.bootloaderusart.ser0_alt=USART0 (alt): TX PA4, RX PA5
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdaopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1
avrdaopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdaopti.menu.bootloaderusart.ser1_alt=USART1 (alt): TX PC4, RX PC5 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdaopti.menu.bootloaderusart.ser2=USART2: TX PF0, RX PF1
avrdaopti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdaopti.menu.bootloaderusart.ser2_alt=USART2 (alt): TX PF4, RX PF5 (32+-pin only)
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdaopti.menu.bootloaderusart.ser3=USART3: TX PB0, RX PB1 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdaopti.menu.bootloaderusart.ser3_alt=USART3 (alt): TX PB4, RX PB5 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdaopti.menu.bootloaderusart.ser4=USART4: TX PE0, RX PE1 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdaopti.menu.bootloaderusart.ser4_alt=USART4 (alt): TX PE4, RX PE5 (64-pin only)
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdaopti.menu.bootloaderusart.ser5=USART5: TX PG0, RX PG1 (64-pin only)
avrdaopti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdaopti.menu.bootloaderusart.ser5_alt=USART5 (alt): TX PG4, RX PG5 (64-pin only)
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt
avrdbopti.name=AVR DB-series (Optiboot)


#########################################
#
#    AVR DB-series (Optiboot)
#
#########################################

################################
# Constant across all settings #
################################

avrdbopti.upload.tool=avrdude

# Upload settings
avrdbopti.upload.protocol=arduino
avrdbopti.upload.extra_params=-D
avrdbopti.upload.speed=115200

