lerouxb/arduino-config-parser/output/DxCore/boards.txt
# Enable SerialEvent, even though it's bad
avrdbopti.menu.serialevent.no=No
avrdbopti.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
avrdbopti.menu.serialevent.yes=Yes

# BrownOut Detect Options
avrdbopti.menu.bodvoltage.1v9=1.9V
avrdbopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdbopti.menu.bodvoltage.2v45=2.45V
avrdbopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdbopti.menu.bodvoltage.2v70=2.70V
avrdbopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdbopti.menu.bodvoltage.2v85=2.85V
avrdbopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdbopti.menu.bodmode.disabled=Disabled/Disabled
avrdbopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdbopti.menu.bodmode.enabled=Enabled/Enabled
avrdbopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdbopti.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
avrdbopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdbopti.menu.bodmode.ensampslo=Enabled/Sampled (125Hz)
avrdbopti.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
avrdbopti.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
avrdbopti.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
avrdbopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdbopti.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
avrdbopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdbopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdbopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100
avrdbopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdbopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdbopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010

# Reset pin as GPIO option
avrdbopti.menu.resetpin.reset=Hardware Reset (recommended)
avrdbopti.menu.resetpin.reset.bootloader.resetpinbits=10
avrdbopti.menu.resetpin.input=Input (no output, ever)
avrdbopti.menu.resetpin.input.bootloader.resetpinbits=00

# millis/micros timing source
# TCD0 and RTC not yet supported
avrdbopti.menu.millis.tcb2=TCB2
avrdbopti.menu.millis.tcb2.build.millistimer=B2
avrdbopti.menu.millis.tcb0=TCB0
avrdbopti.menu.millis.tcb0.build.millistimer=B0
avrdbopti.menu.millis.tcb1=TCB1
avrdbopti.menu.millis.tcb1.build.millistimer=B1
avrdbopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdbopti.menu.millis.tcb3.build.millistimer=B3
avrdbopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdbopti.menu.millis.tcb4.build.millistimer=B4
avrdbopti.menu.millis.tca0=TCA0
avrdbopti.menu.millis.tca0.build.millistimer=A0
avrdbopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdbopti.menu.millis.tca1.build.millistimer=A1
#avrdbopti.menu.millis.tcd0=TCD0
#avrdbopti.menu.millis.rtc=RTC (no micros)
#avrdbopti.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal no micros
#avrdbopti.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrdbopti.menu.millis.disabled=Disabled
#avrdbopti.menu.millis.tcd0.build.millistimer=D0
#avrdbopti.menu.millis.rtc.build.millistimer=RTC
#avrdbopti.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrdbopti.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrdbopti.menu.millis.disabled.build.millistimer=NONE

#avrdbopti.menu.mvio.enabled=Enabled
#avrdbopti.menu.mvio.enabled.bootloader.mviobits=01
#avrdbopti.menu.mvio.disabled=Disabled
#avrdbopti.menu.mvio.disabled.bootloader.mviobits=10

# Startup Time
avrdbopti.menu.startuptime.8= 8ms
avrdbopti.menu.startuptime.8.bootloader.sutbits=100
avrdbopti.menu.startuptime.1= 1ms
avrdbopti.menu.startuptime.1.bootloader.sutbits=001
avrdbopti.menu.startuptime.2= 2ms
avrdbopti.menu.startuptime.2.bootloader.sutbits=010
avrdbopti.menu.startuptime.4= 4ms
avrdbopti.menu.startuptime.4.bootloader.sutbits=011
avrdbopti.menu.startuptime.16= 16ms
avrdbopti.menu.startuptime.16.bootloader.sutbits=101
avrdbopti.menu.startuptime.32= 32ms
avrdbopti.menu.startuptime.32.bootloader.sutbits=110
avrdbopti.menu.startuptime.64= 64ms
avrdbopti.menu.startuptime.64.bootloader.sutbits=111
avrdbopti.menu.startuptime.0.bootloader.sutbits=000


# Optiboot Upload Timeout
avrdbopti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdbopti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdbopti.menu.timeout.8sec.bootloader.timeout=_8sec

# Optiboot Serial Port
avrdbopti.menu.bootloaderusart.ser0=USART0: TX PA0, RX PA1
avrdbopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdbopti.menu.bootloaderusart.ser0_alt=USART0 (alt): TX PA4, RX PA5
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdbopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1
avrdbopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdbopti.menu.bootloaderusart.ser1_alt=USART1 (alt): TX PC4, RX PC5 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdbopti.menu.bootloaderusart.ser2=USART2: TX PF0, RX PF1
avrdbopti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdbopti.menu.bootloaderusart.ser2_alt=USART2 (alt): TX PF4, RX PF5 (32+-pin only)
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdbopti.menu.bootloaderusart.ser3=USART3: TX PB0, RX PB1 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdbopti.menu.bootloaderusart.ser3_alt=USART3 (alt): TX PB4, RX PB5 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdbopti.menu.bootloaderusart.ser4=USART4: TX PE0, RX PE1 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdbopti.menu.bootloaderusart.ser4_alt=USART4 (alt): TX PE4, RX PE5 (64-pin only)
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdbopti.menu.bootloaderusart.ser5=USART5: TX PG0, RX PG1 (64-pin only)
avrdbopti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdbopti.menu.bootloaderusart.ser5_alt=USART5 (alt): TX PG4, RX PG5 (64-pin only)
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt